---
kind: type
id: T:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegend
source: html/c9bd55c9-e4fc-8a7a-0cd9-b2605fcb6a56.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegend

The legend that describes an Analysis Visualization.

## Syntax (C#)
```csharp
public class AnalysisDisplayLegend : Element
```